src/test/resources/WS/xmlBodies/getQALarge.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xft="http://www.exchangefortravel.org/xft/current" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-16009048" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>svc-test-healthcheck</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">986+PRTy</wsse:Password>
                <wsu:Created>2014-07-08T10:26:01+02:00</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <Transaction xsi:schemaLocation="http://www.exchangefortravel.org/xft/current http://www.exchangefortravel.org/xft/current/xft.xsd" Version="1.1" TimeStamp="2014-07-08T08:26:01+00:00" xsi:type="TransactionRequestType" xmlns="http://www.exchangefortravel.org/xft/current" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.exchangefortravel.org/xft/current" xmlns:xi="http://www.w3.org/2001/XInclude">
            <Control>
                <Requester Channel="Internet" Code="PV" Application="ALP" Engine="PV" Tool="BookingEngine">
                    <Host Name="ERESAHD"/>
                    <Country Code="FR"/>
                    <Person>
                        <Codes>
                            <Code Role="Offer" Name="RatePlan"/>
                        </Codes>
                    </Person>
                </Requester>
            </Control>
            <Action Purpose="Get" Code="QuotedAvailability"/>
            <Style Direction="Out">
                <Language Code="FR"/>
            </Style>
            <Trip>
                <Segment xsi:type="SegmentProductType">
                    <Code Role="Product" Value="${Site}"/>


                    <Begin Value="${Date}"/>

                    <Duration Value="7" Unit="Night"/>
                </Segment>
                <Travellers Filter="Exclude">
                    <Traveller ID="T1" Type="Adult">
                        <Name>
                            <FirstName ID="FNAME">FNAME</FirstName>
                            <LastName ID="NAME" Title="Mr">LNAME</LastName>
                        </Name>
                    </Traveller>
                </Travellers>
            </Trip>
        </Transaction>
    </soapenv:Body>
</soapenv:Envelope>